Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler class is the direct manipulation toleration handling class.
Remarks:
During runtime, all functionality runs in the same thread.
All calls to any public methods are invoked to the AKit thread, therefore no internal locks are required for this class.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.AilDmPickerCommand
Expected command name for picker command.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.inputsHandler
The inputs handler.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler class.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler class.
Subscribes to the Tekla.Structures.DirectManipulation.Adapter.EventRegistry in order to be able to receive events from Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.TolerationChanged
The event raised when the toleration data changed.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.InputsReceived
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.InputsReceived event occurs when the user inputs are received.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.NumericInputStarted
The event raised when numeric input is started.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.InteractorType


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.Imports
Gets the imported toleration handler functions.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.DrawSnapSymbol(Tekla.BIM.DirectManipulation.Services.Toleration.SnappedPoint)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.SetInteractorType(Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.GetSnappingReferencePoint


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.SetSnappingReferencePoint(Tekla.Common.Geometry.Vector3)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.ClearSnappingReferencePoint


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.SetTolerationListenerConfiguration(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationListenerConfiguration)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.AddPickedPointToCommandContext(Tekla.Common.Geometry.Vector3,System.Boolean)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.ClearCommandContextPickedPoints


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.GetSnapStep(Tekla.Common.Geometry.Vector3,Tekla.BIM.DirectManipulation.Services.Toleration.CameraData,Tekla.BIM.DirectManipulation.Services.Toleration.SnapStepType)


Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.TryGetTolerationEventArgs(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@)
Tries to get the most recent Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs from TS core.
eventArgs: The resulting event arguments, or null if getting failed.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.GetCursorEventArgs(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@,System.Int32@)
Tries to get the most recent cursor event data from Tekla Structures core.
eventArgs: The resulting event arguments, or null if getting failed.
handleIdentifier: The identifier of the associated handle; or zero, if no handle is associated.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.GetHandleTolerationData(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@,System.Int32@)
Tries to get the most recent Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs from Tekla Structures core.
eventArgs: The resulting event arguments, or null if getting failed.
handleIdentifier: The identifier of the associated handle; or zero, if no handle is associated.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.GetOrtho
Gets the ortho status.
Returns: The ortho status.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.SetOrtho(System.Boolean)
Sets the ortho status.
isEnabled: A value indicating whether to enable the orthogonal snap switch.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.NumericInputStarting
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.NumericInputStarted event.
Returns: The function to call when numeric input is completed, or null if no handler for that event was found.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.OnTolerationChanged(System.String)
Raises the TolerationChanged event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.TolerationEvents.TolerationChanged.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler.OnUsersInputReceived(System.String)
Raises the UsersInputReceived event.
param: The parameter.